{
    "essay": [
        {
            "title": "The most Unfortunate Mishap is often a Miscommunication",
            "headline": "After waiting for me to get ready, Ricky finally got in his car at 12 pm when we talked about being on the doors at 11 am...",
            "imageName": "img/tincan.jpg",
            "body": `The most unfortunate mishap is often a miscommunication 
            After waiting for me to get ready, Ricky finally got in his car at 12 pm when we talked about being on the doors at 11 am. Damn I need a pen. “Hold on I’ll be right back. I need a pen.” I fumbled around sending Ricky the address via text while finding a pen. When I Got back in the car I thought Ricky said yes when he said no. I asked if I sent him the address. we sat in the driveway for 3 minutes. Him being patient. Me being high and on my phone texting N$&& about investing in stocks. An earlier version of me would have gotten slightly angry with him for letting us waste so much time. The three minutes. I have realized that this is me shifting the blame onto him and that is the real source of the anger. The blame of my fault on the miscommunication that led to our wasted time and what would have been some feeling of bitterness had I not learned more about myself and understanding people and why they do what they do, to the extent of which we are capable. The blame of miscommunication is one that cannot be avoided. No matter how perfect we try to be, because miscommunications are inevitable. The tragedy is when they turn into true mishaps. Accept fault for the miscommunication regardless of what side of blame you think you are. For every miscommunication has at least two parties at fault and no one is 100% free from blame. Ricky could have talked louder, he could have confirmed. I could have confirmed. As always it is best to be proactive with an apology if the miscommunication goes beyond the confirming what was conveyed. The confirmation and trying to speak in terms of which the other person understands are the two things that I think we could focus on to try to avoid miscommunication. Here I will discuss them in reverse order for the sake of a full explanation. 
            
            Speaking in terms in which the other person can understand
            The clearest explanation of this is speaking the same language. It then gets more strict with dialects and colloquialisms as they can sometimes mean different things so it’s worth getting to know people and the way they talk. Speaking someone’s colloquialisms or even slang words can go along way with a first impression. The next time you met someone from Ohio, or especially Ohio State, say loudly, “O-H!” and see what they say back. Talking in terms in which a person does NOT understand on purpose can lead to getting into a bad situation and is why so many people get into loans and contracts that keep them in poverty or on the shit end of the stick in some other way. Whenever dealing with someone who doesn’t explain themselves always get an attorney or find someone else to do business with. As a salesman or anyone else in the position like so many greedy companies to day, if you do this, I urge you to reevaluate what a lie is worth to you and try to think of some other way to gain profits by actually providing a worthwhile service you’re proud to explain plainly. So talk in terms in which the other person understands to the best of your ability. Go above and beyond to avoid words they may not be familiar with without proactively defining them. Don’t make bad deals. 
            
            Confirmation 
            Don’t get to the 5 yard line and fumble. Don’t stop three feet from gold. Don’t spend your time and resources on setting up a deal, a date or occasion, or any other agreement just to not confirm what the other person said or confirm that they heard you correctly. Many mishaps could have been avoided simply by asking, “would you repeat back to me what we’ve agreed upon so that I know I have explained myself thoroughly”. Let me explain the wrong way to do that, “can you read that back to me so I know you have it down correctly”. The difference is the first one puts any possible blame or error on myself instead of the other person. This simple phrase could save your day, or your money, or time - let us not even mention the amount of frustration involved with fixing the mishap of a miscommunication. Imagine it’s not confirming the wedding date with the reception host. Some things just cannot be fixed nicely or easily or at all. All because of a simple miscommunication.`
        },
        {
            "title": "Clark",
            "headline": "Kent",
            "imageName": "Reporter",
            "body": ""
        },
        {
            "title": "Clark",
            "headline": "Kent",
            "imageName": "Reporter",
            "body": ""
        }
    ]
 }
 